Old Code/Theory of Programming Languages/Ruby on Rails/assign5/app/controllers/shipments_controller.rb

SELECT * FROM `shipments` WHERE (`shipments`.`id` = 1)
---
  def show
    @shipment = Shipment.find(params[:id])

SELECT * FROM `shipments` WHERE (`shipments`.`id` = 4491622)
---
  def edit
    @shipment = Shipment.find(params[:id])

INSERT INTO `shipments` (`part_id`, `qty`, `updated_at`, `price`, `date_shipped`, `supplier_id`, `created_at`) VALUES(2, 2, '2009-04-21 22:19:25', 1.0, '1985-12-20', 1, '2009-04-21 22:19:25')
---
  def create
    @shipment = Shipment.new(params[:shipment])
    if supplier_logged_in?(@shipment.supplier_id)
     respond_to do |format|
        if @shipment.save

SELECT * FROM `shipments` WHERE (`shipments`.`id` = 39858256)
UPDATE `shipments` SET `updated_at` = '2009-04-21 22:18:49', `qty` = 300 WHERE `id` = 39858256
---
  def update
    @shipment = Shipment.find(params[:id])

    respond_to do |format|
      if @shipment.update_attributes(params[:shipment])

SELECT * FROM `shipments` WHERE (`shipments`.`id` = 1054583386)
DELETE FROM `shipments` WHERE `id` = 1054583386
---
  def destroy
    @shipment = Shipment.find(params[:id])
    @shipment.destroy